yosys read_verilog "$::env(DESIGN_HOME)/vexriscv.demo.GenFull.v"
yosys hierarchy -top vexriscv.demo.GenFull

yosys proc
yosys proc_dff
yosys opt
yosys memory
yosys opt
yosys fsm
yosys opt

# Expand internal cell types into real explicit Verilog cells
yosys techmap
yosys simplemap
yosys opt_clean

# Generic synthesis
yosys synth -noabc -top vexriscv.demo.GenFull

# Write purely structural Verilog:
yosys write_verilog -noexpr -nodec -attr2comment naja_netlist.v
